tap "codecrafters-io/tap"
tap "felixkratz/formulae"
tap "homebrew/bundle"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "nikitabobko/tap"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
brew "atuin", restart_service: :changed
brew "bat"
brew "chezmoi"
brew "coreutils"
brew "curl"
brew "direnv"
brew "docker"
brew "exercism"
brew "eza"
brew "fzf"
brew "gawk"
brew "git"
brew "gnupg"
brew "go"
brew "lazygit"
brew "lua"
brew "lua-language-server"
brew "luarocks"
brew "mas"
brew "mp3info"
brew "neovim"
brew "nowplaying-cli"
brew "postgresql@14", restart_service: :changed
brew "redis"
brew "rename"
brew "ripgrep"
brew "ruby-build"
brew "spicetify-cli"
brew "starship"
brew "stow"
brew "switchaudio-osx"
brew "tmux"
brew "tree"
brew "wget"
brew "yazi"
brew "zork"
brew "zoxide"
brew "codecrafters-io/tap/codecrafters"
brew "felixkratz/formulae/sketchybar"
brew "koekeishiya/formulae/skhd"
brew "qmk/qmk/qmk"
cask "1password"
cask "1password-cli"
cask "aerospace"
cask "arc"
cask "backblaze"
cask "chatgpt"
cask "discord"
cask "firefox"
cask "font-sf-mono"
cask "font-sf-pro"
cask "google-chrome"
cask "halloy"
cask "iina"
cask "imageoptim"
cask "karabiner-elements"
cask "keymapp"
cask "obsidian"
cask "qmk-toolbox"
cask "rar"
cask "raycast"
cask "reader"
cask "sabnzbd"
cask "sf-symbols"
cask "slack"
cask "spotify"
cask "stats"
cask "steam"
cask "the-unarchiver"
cask "todoist"
cask "visual-studio-code"
cask "wezterm"
mas "1Password for Safari", id: 1569813296
mas "Amphetamine", id: 937984704
mas "Cardhop", id: 1290358394
mas "CardPointers", id: 1472875808
mas "Controller", id: 1198176727
mas "Fantastical", id: 975937182
mas "GoodLinks", id: 1474335294
mas "HomeCam", id: 1292995895
mas "HomeControl", id: 1547121417
mas "HomePass", id: 1330266650
mas "Infuse", id: 1136220934
mas "IPTV Expert", id: 1641944027
mas "Kindle", id: 302584613
mas "Mela", id: 1568924476
mas "Microsoft Excel", id: 462058435
mas "NextDNS", id: 1464122853
mas "Perplexity", id: 6714467650
mas "stoic.", id: 1312926037
mas "Tailscale", id: 1475387142
mas "Things", id: 904280696
mas "Xcode", id: 497799835
vscode "arthurwang.vsc-prolog"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "dbaeumer.vscode-eslint"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "rust-lang.rust-analyzer"
vscode "shopify.ruby-lsp"
vscode "vscodevim.vim"
vscode "vue.volar"
